Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcretePolygon.PolygonDefinition
Indicates whether the polygon contour is inscribed or circumscribed.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcretePolygon.Sides
Number of sides of the polygon contour.
Since:
2027

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcretePolygon.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Int32,Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionPolygonDefinition)
Creates a new instance of Structural Section Concrete Polygon shape with the associated set of parameters,
used to attach to structural element.
diameter:
The diameter of the inscribed or circumscribed circle.
centroidHorizontal:
Distance from centroid to the left extremites along horizontal axis.
centroidVertical:
Distance from centroid to the upper extremites along vertical axis.
principalAxesAngle:
Rotation angle between the principal axes and cross section reference planes.
sectionArea:
Cross section area.
perimeter:
Painting surface of the unit length.
nominalWeight:
Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.
momentOfInertiaStrongAxis:
Moment of Inertia about main strong axis (I).
momentOfInertiaWeakAxis:
Moment of Inertia about main weak axis (I).
elasticModulusStrongAxis:
Elastic section modulus about main strong axis for calculation of bending stresses.
elasticModulusWeakAxis:
Elastic section modulus about main weak axis for calculation of bending stresses.
plasticModulusStrongAxis:
Plastic section modulus in bending about main strong axis (Z, Wpl)
plasticModulusWeakAxis:
Plastic section modulus in bending about main weak axis.
torsionalMomentOfInertia:
Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation
torsionalModulus:
Section modulus for calculations of torsion stresses (Ct)
warpingConstant:
Warping constant (Cw, Iomega, H)
shearAreaStrongAxis:
Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).
shearAreaWeakAxis:
Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).
sides:
Number of sides of the polygon contour.
Must between 3 and 36.
polygonDefinition:
Indicates whether the polygon contour is inscribed or circumscribed.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcretePolygon
Defines parameters for parameterized concrete polygon structural section.
Since:
2027